# Лабораторная работа - Реализация DHCPv4  

## Цели  
Часть 1. Создание сети и настройка основных параметров устройства  
Часть 2. Настройка и проверка двух серверов DHCPv4 на R1  
Часть 3. Настройка и проверка DHCP-ретрансляции на R2  

## Топология

![image](https://user-images.githubusercontent.com/130133180/235457111-615f3fd3-2f45-414d-817b-8708666069e3.png)

## Таблица адресации  

|      Device     |      Interface     |      IP Address     |      Subnet Mask       |      Default Gateway     |
|-----------------|--------------------|---------------------|------------------------|--------------------------|
|     R1          |     e0/0           |     10.0.0.1        |     255.255.255.252    |     N/A                  |
|     R1          |     e0/1           |     N/A             |     N/A                |     N/A                  |
|     R1          |     e0/1.100       |     192.168.1.1     |     255.255.255.192    |     N/A                  |
|     R1          |     e0/1.200       |     192.168.1.65    |     255.255.255.224    |     N/A                  |
|     R1          |     e0/1.1000      |     N/A             |     N/A                |     N/A                  |
|     R2          |     e0/0           |     10.0.0.2        |     255.255.255.252    |     N/A                  |
|     R2          |     e0/1           |     192.168.1.97    |     255.255.255.240    |     N/A                  |
|     S1          |     VLAN 200       |     192.168.1.66    |     255.255.255.224    |     192.168.1.65         |
|     S2          |     VLAN 1         |     192.168.1.98    |     255.255.255.240    |     192.168.1.97         |
|     PC-A        |     NIC            |     DHCP            |     DHCP               |     DHCP                 |
|     PC-B        |     NIC            |     DHCP            |     DHCP               |     DHCP                 |

## Таблица VLAN

|      VLAN     |      Name          |      Interface Assigned            |
|---------------|--------------------|------------------------------------|
|     1         |     N/A            |     S2: e0/0                       |
|     100       |     Clients        |     S1: e0/0                       |
|     200       |     Management     |     S1: VLAN 200                   |
|     999       |     Parking_Lot    |     S1: e0/2-e0/3                  |
|     1000      |     Native         |     N/A                            |

## Часть 1. Создание сети и настройка основных параметров устройства  
### Шаг 1. Создание схемы адресации  
Сеть 192.168.1.0/24 разбить в соответствии со след. схемами:  
а. Одна подсеть, «Подсеть A», поддерживающая 58 хостов (клиентская VLAN на маршрутизаторе R1).  

Подсеть А:  

> 192.168.1.0/26 (.1 - .62)  

Запишите первый IP-адрес в таблицу адресации для маршрутизатора R1 e0/1.100. Запишите второй IP-адрес в таблицу адресов для S1 VLAN 200 и введите соответствующий шлюз по умолчанию.

б. Одна подсеть, «Подсеть B», поддерживающая 28 хостов (VLAN управления на R1).  

Подсеть Б:  

> 192.168.1.64/27 (.65-.94)  

Запишите первый IP-адрес в таблицу адресации для маршрутизатора R1 e0/1.200. Запишите второй IP-адрес в таблицу адресов для S1 VLAN 1 и введите соответствующий шлюз по умолчанию.  

в. Одна подсеть, «Подсеть C», поддерживающая 12 хостов (клиентская сеть на R2).  

Подсеть С:  

> 192.168.1.96/28 (.97-.110)  

Запишите первый IP-адрес в таблицу адресации для маршрутизатора R2 e0/1.

### Шаг 2. Создайте сеть согласно топологии  
Подключите устройства, как показано в топологии, и подсоедините необходимые кабели.  

### Шаг 3. Произведите базовую настройку маршрутизаторов.
a. Назначьте маршрутизатору имя устройства. 
```
Router(config)#hostname R1
Router(config)#hostname R2
```
b. Отключите поиск DNS, чтобы предотвратить попытки маршрутизатора неверно преобразовывать
введенные команды таким образом, как будто они являются именами узлов.  
```
R1(config)#no ip domain lookup
R2(config)#no ip domain lookup
```
c. Назначьте class в качестве зашифрованного пароля привилегированного режима EXEC.  
```
R1(config)#enable secret class
R2(config)#enable secret class
```
d. Назначьте cisco в качестве пароля консоли и включите вход в систему по паролю.  
```
R1(config)#line console 0
R1(config-line)#password cisco
R1(config-line)#login


R2(config)#line console 0
R2(config-line)#password cisco
R2(config-line)#login
```
e. Назначьте cisco в качестве пароля VTY и включите вход в систему по паролю.  
```
R1(config)#line vty 0 4
R1(config-line)#password cisco
R1(config-line)#login

R2(config)#line vty 0 4
R2(config-line)#password cisco
R2(config-line)#login
```
f. Зашифруйте открытые пароли.  
```
R1(config)#service password-encryption

R2(config)#service password-encryption
```
g. Создайте баннер с предупреждением о запрете несанкционированного доступа к устройству.  
```
R1(config)#banner motd "Unauthorized access is denied"

R2(config)#banner motd "Unauthorized access is denied"
```
h. Сохраните текущую конфигурацию в файл загрузочной конфигурации.  
```
R1#copy running-config startup-config

R2#copy running-config startup-config
```
i. Установите часы на маршрутизаторе на сегодняшнее время и дату.  
```
R1#clock set 15:59:00 01 may 2023

R2#clock set 15:59:00 01 may 2023
```


